MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4553/mcu.h
// Register: PORTD
#define PORTD PORTD
extern volatile unsigned char           PORTD               __at(0xF83);
#ifndef _LIB_BUILD
asm("PORTD equ 0F83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0                    :1;
        unsigned RD1                    :1;
        unsigned RD2                    :1;
        unsigned RD3                    :1;
        unsigned RD4                    :1;
        unsigned RD5                    :1;
        unsigned RD6                    :1;
        unsigned RD7                    :1;
    };
    struct {
        unsigned SPP0                   :1;
        unsigned SPP1                   :1;
        unsigned SPP2                   :1;
        unsigned SPP3                   :1;
        unsigned SPP4                   :1;
        unsigned SPP5                   :1;
        unsigned SPP6                   :1;
        unsigned SPP7                   :1;
    };
    struct {
        unsigned                        :7;
        unsigned SS2                    :1;
    };
} PORTDbits_t;
extern volatile PORTDbits_t PORTDbits __at(0xF83);
// bitfield macros
#define _PORTD_RD0_POSN                                     0x0
#define _PORTD_RD0_POSITION                                 0x0
#define _PORTD_RD0_SIZE                                     0x1
#define _PORTD_RD0_LENGTH                                   0x1
#define _PORTD_RD0_MASK                                     0x1
#define _PORTD_RD1_POSN                                     0x1
#define _PORTD_RD1_POSITION                                 0x1
#define _PORTD_RD1_SIZE                                     0x1
#define _PORTD_RD1_LENGTH                                   0x1
#define _PORTD_RD1_MASK                                     0x2
#define _PORTD_RD2_POSN                                     0x2
#define _PORTD_RD2_POSITION                                 0x2
#define _PORTD_RD2_SIZE                                     0x1
#define _PORTD_RD2_LENGTH                                   0x1
#define _PORTD_RD2_MASK                                     0x4
#define _PORTD_RD3_POSN                                     0x3
#define _PORTD_RD3_POSITION                                 0x3
#define _PORTD_RD3_SIZE                                     0x1
#define _PORTD_RD3_LENGTH                                   0x1
#define _PORTD_RD3_MASK                                     0x8
#define _PORTD_RD4_POSN                                     0x4
#define _PORTD_RD4_POSITION                                 0x4
#define _PORTD_RD4_SIZE                                     0x1
#define _PORTD_RD4_LENGTH                                   0x1
#define _PORTD_RD4_MASK                                     0x10
#define _PORTD_RD5_POSN                                     0x5
#define _PORTD_RD5_POSITION                                 0x5
#define _PORTD_RD5_SIZE                                     0x1
#define _PORTD_RD5_LENGTH                                   0x1
#define _PORTD_RD5_MASK                                     0x20
#define _PORTD_RD6_POSN                                     0x6
#define _PORTD_RD6_POSITION                                 0x6
#define _PORTD_RD6_SIZE                                     0x1
#define _PORTD_RD6_LENGTH                                   0x1
#define _PORTD_RD6_MASK                                     0x40
#define _PORTD_RD7_POSN                                     0x7
#define _PORTD_RD7_POSITION                                 0x7
#define _PORTD_RD7_SIZE                                     0x1
#define _PORTD_RD7_LENGTH                                   0x1
#define _PORTD_RD7_MASK                                     0x80
#define _PORTD_SPP0_POSN                                    0x0
#define _PORTD_SPP0_POSITION                                0x0
#define _PORTD_SPP0_SIZE                                    0x1
#define _PORTD_SPP0_LENGTH                                  0x1
#define _PORTD_SPP0_MASK                                    0x1
#define _PORTD_SPP1_POSN                                    0x1
#define _PORTD_SPP1_POSITION                                0x1
#define _PORTD_SPP1_SIZE                                    0x1
#define _PORTD_SPP1_LENGTH                                  0x1
#define _PORTD_SPP1_MASK                                    0x2
#define _PORTD_SPP2_POSN                                    0x2
#define _PORTD_SPP2_POSITION                                0x2
#define _PORTD_SPP2_SIZE                                    0x1
#define _PORTD_SPP2_LENGTH                                  0x1
#define _PORTD_SPP2_MASK                                    0x4
#define _PORTD_SPP3_POSN                                    0x3
#define _PORTD_SPP3_POSITION                                0x3
#define _PORTD_SPP3_SIZE                                    0x1
#define _PORTD_SPP3_LENGTH                                  0x1
#define _PORTD_SPP3_MASK                                    0x8
#define _PORTD_SPP4_POSN                                    0x4
#define _PORTD_SPP4_POSITION                                0x4
#define _PORTD_SPP4_SIZE                                    0x1
#define _PORTD_SPP4_LENGTH                                  0x1
#define _PORTD_SPP4_MASK                                    0x10
#define _PORTD_SPP5_POSN                                    0x5
#define _PORTD_SPP5_POSITION                                0x5
#define _PORTD_SPP5_SIZE                                    0x1
#define _PORTD_SPP5_LENGTH                                  0x1
#define _PORTD_SPP5_MASK                                    0x20
#define _PORTD_SPP6_POSN                                    0x6
#define _PORTD_SPP6_POSITION                                0x6
#define _PORTD_SPP6_SIZE                                    0x1
#define _PORTD_SPP6_LENGTH                                  0x1
#define _PORTD_SPP6_MASK                                    0x40
#define _PORTD_SPP7_POSN                                    0x7
#define _PORTD_SPP7_POSITION                                0x7
#define _PORTD_SPP7_SIZE                                    0x1
#define _PORTD_SPP7_LENGTH                                  0x1
#define _PORTD_SPP7_MASK                                    0x80
#define _PORTD_SS2_POSN                                     0x7
#define _PORTD_SS2_POSITION                                 0x7
#define _PORTD_SS2_SIZE                                     0x1
#define _PORTD_SS2_LENGTH                                   0x1
#define _PORTD_SS2_MASK                                     0x80

// Register: PORTE
#define PORTE PORTE
extern volatile unsigned char           PORTE               __at(0xF84);
#ifndef _LIB_BUILD
asm("PORTE equ 0F84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0                    :1;
        unsigned RE1                    :1;
        unsigned RE2                    :1;
        unsigned RE3                    :1;
        unsigned                        :3;
        unsigned RDPU                   :1;
    };
    struct {
        unsigned CK1SPP                 :1;
        unsigned CK2SPP                 :1;
        unsigned OESPP                  :1;
    };
    struct {
        unsigned PD2                    :1;
        unsigned PC2                    :1;
        unsigned CCP10                  :1;
        unsigned CCP9E                  :1;
        unsigned                        :3;
        unsigned CCP2E                  :1;
    };
    struct {
        unsigned RDE                    :1;
        unsigned WRE                    :1;
        unsigned CS                     :1;
        unsigned PC3E                   :1;
        unsigned                        :3;
        unsigned PA2E                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PB2                    :1;
        unsigned                        :4;
        unsigned RE7                    :1;
    };
} PORTEbits_t;
